# Список доступных слов для угадывания

words = [ 'слова', 'для', 'угадывания']

for i in range(len(words)):
    print('# ', i, ': ', words[i])

print('Выберите номер слова для угадывания:')
word = words[int(input())]

print('')
print('========== ========== ========== ========== ========== ========== ========== ========== ========== ==========')

# В цикле:
# 1. Выводим текущее слово с учетом угаданных букв
# 2. Спрашиваем букву
# 3. Делаем проверки, изменяем строку для вывода на экран
# 4. Переходим к п. 1




